
&Вместо("ПослеНачалаРаботыСистемы")
Процедура Рмк_ПослеНачалаРаботыСистемы()
		ПараметрыРаботыКлиента = СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиентаПриЗапуске();

	// ЗнакомствоСРедакциейВ30
	Если ПараметрыРаботыКлиента.Свойство("ПоказатьЗнакомствоСРедакциейВ30")
		И ПараметрыРаботыКлиента.ПоказатьЗнакомствоСРедакциейВ30 Тогда
		ОбщегоНазначенияБПКлиент.ОткрытьНачинаемРаботатьВ30(ПараметрыРаботыКлиента.ИмяОбработкиЗнакомствоСРедакциейВ30);
	КонецЕсли;	
	// Конец ЗнакомствоСРедакциейВ30
	
	// ПечатьПараметровУчета
	Если ПараметрыРаботыКлиента.Свойство("ПоказатьПечатьПараметровУчета")
		И ПараметрыРаботыКлиента.ПоказатьПечатьПараметровУчета Тогда
		ОбщегоНазначенияБПКлиент.ОткрытьПечатьПараметровУчета(ПараметрыРаботыКлиента.ИмяОбработкиПечатьПараметровУчета);
	КонецЕсли;	
	// Конец ПечатьПараметровУчета

	//Если ПараметрыРаботыКлиента.Свойство("ПоказатьПредложитьОбновитьВерсиюПрограммы") 
	//	И ПараметрыРаботыКлиента.ПоказатьПредложитьОбновитьВерсиюПрограммы Тогда
	//	// Информация о необходимости обновить конфигурацию
	//	ОбщегоНазначенияБПКлиент.ПредупредитьОНеобходимостиОбновленияПрограммы(ПараметрыРаботыКлиента);
	//КонецЕсли;

КонецПроцедуры
