
&Вместо("ПолучитьЦенуНоменклатуры")
Функция Рмк_ПолучитьЦенуНоменклатуры(СтруктураДанных)
		Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.ТипЦен.ВалютаЦены КАК ЦеныНоменклатурыВалюта,
		|	ЦеныНоменклатурыСрезПоследних.ТипЦен.ЦенаВключаетНалоги КАК ЦенаВключаетНалоги,
		|	ЦеныНоменклатурыСрезПоследних.ТипЦен.ПорядокОкругления КАК ПорядокОкругления,
		|	ЦеныНоменклатурыСрезПоследних.ТипЦен.ОкруглятьВБольшуюСторону КАК ОкруглятьВБольшуюСторону,
		|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена * КурсВалютыВидЦен.Курс * КурсВалютыДокумента.Кратность / (КурсВалютыДокумента.Курс * КурсВалютыВидЦен.Кратность), 0) КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			&Период,
		|			Организация = &Организация  
		|				И Номенклатура = &Номенклатура
		|				И ТипЦен = &ТипЦен) КАК ЦеныНоменклатурыСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, ) КАК КурсВалютыВидЦен
		|		ПО ЦеныНоменклатурыСрезПоследних.ТипЦен.ВалютаЦены = КурсВалютыВидЦен.Валюта,
		|	РегистрСведений.КурсыВалют.СрезПоследних(&Период, Валюта = &ВалютаДокумента) КАК КурсВалютыДокумента";
	Запрос.УстановитьПараметр("Период",       		СтруктураДанных.Дата);
	Запрос.УстановитьПараметр("Номенклатура", 		СтруктураДанных.Номенклатура); 
	Запрос.УстановитьПараметр("Организация", 		СтруктураДанных.Организация);
	Запрос.УстановитьПараметр("ТипЦен",       		СтруктураДанных.ТипЦен);
	Запрос.УстановитьПараметр("ВалютаДокумента",	СтруктураДанных.ВалютаДокумента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Цена = 0;
	Пока Выборка.Следующий() Цикл
		
		Цена					= Выборка.Цена;
		ПорядокОкругления		= Выборка.ПорядокОкругления;
		ОкруглятьВБольшуюСторону= Выборка.ОкруглятьВБольшуюСторону;
		
		Если СтруктураДанных.Свойство("СуммаВключаетНалоги")
			И ((СтруктураДанных.СуммаВключаетНалоги И НЕ Выборка.ЦенаВключаетНалоги)
				ИЛИ (НЕ СтруктураДанных.СуммаВключаетНалоги И Выборка.ЦенаВключаетНалоги)) Тогда
				
				Цена = УчетНДСКлиентСервер.ПересчитатьЦенуПриИзмененииФлаговНалогов(Цена,
												Выборка.ЦенаВключаетНалоги,
												СтруктураДанных.СуммаВключаетНалоги,
												УчетНДС.ПолучитьСтавкуНДС(СтруктураДанных.Дата, СтруктураДанных.СтавкаНДС),
												УчетНДС.ПолучитьСтавкуНСП(СтруктураДанных.Дата, СтруктураДанных.Организация, СтруктураДанных.СтавкаНСП));
		КонецЕсли;
		
		ТочностьЦены = 0;
		СтруктураДанных.Свойство("ТочностьЦены", ТочностьЦены);
		
		Цена = ОкруглитьЦену(Цена, ПорядокОкругления, ОкруглятьВБольшуюСторону, ТочностьЦены);
	КонецЦикла;
	
	Возврат Цена;


КонецФункции
